huygithcm/code_tung/esp32_car/src/main.cpp
    // ghi trace (goc tuyet doi theo huong re, de luon duong khi tien toi tgt)
    if (trN < TRMAX) { trT[trN] = (uint16_t)(millis() - t0); trA[trN] = progDeg; trN++; }

    if (fabs(err) < tol) {
      stopMotors();
      if (++settle > 8) { settled = true; break; }  // on dinh ~40ms
    } else {
      settle = 0;
      float d = err - lastErr;
      int spd = (int)(KpT * err + KdT * d);
      spd = constrain(spd, -TURN_MAX, TURN_MAX);   // chan toc do -> bot quan tinh/vot lo
      if (abs(spd) < TURN_MIN) spd = (spd >= 0) ? TURN_MIN : -TURN_MIN;
      int sgn = INVERT_TURN ? -1 : 1;
      driveA(sgn * spd); driveB(-sgn * spd);   // quay tai cho: 2 banh nguoc chieu
    }
    lastErr = err;
    delay(5);
  }
  stopMotors();
  float achievedDeg = (poseTheta - startTheta) * 180.0f / PI;
  float errDeg = deg - achievedDeg;
  unsigned long ms = millis() - t0;
  // Dong ket qua co cau truc cho script tu doc/hieu chuan (Serial + Log xe tren web):
  char res[160];
  snprintf(res, sizeof(res),
    "[turnres] tgt=%.1f dat=%.2f err=%.2f votlo=%.2f ms=%lu %s",
    deg, achievedDeg, errDeg, maxOverDeg, ms, settled ? "ON DINH" : "TIMEOUT");
  hubLog(res);

  // Xuat trace day du de host nhan dang he & tinh PID toi uu (1 lan test)
  if (turnVerbose) {
    Serial.printf("[trace_begin] tgt=%.1f kp=%.1f kd=%.1f n=%d\n", fabs(deg), KpT, KdT, trN);
    for (int i = 0; i < trN; i++) Serial.printf("%u,%.2f\n", trT[i], trA[i]);
    Serial.println("[trace_end]");
  }
}

// ===================== Tien ich =====================
// Phat tone tan so freq (Hz) trong ms mili-giay
void buzzerTone(int freq, int ms) {
  ledcSetup(BUZZER_CH, freq, 8);
  ledcAttachPin(BUZZER, BUZZER_CH);
  ledcWrite(BUZZER_CH, 128);   // 50% duty
  delay(ms);
  ledcWrite(BUZZER_CH, 0);
}
void beep(int ms) { buzzerTone(2000, ms); }

// ===================== Cali line =====================
void saveCalibration();   // dinh nghia o duoi (NVS) - forward declare
// Quy trinh: dem nguoc 5s (tick) -> tone bat dau -> quet thanh cam bien
// qua vach den va nen trang trong 5s -> tone ket thuc -> tinh nguong rieng.
void calibrateLine() {
  Serial.println(F("\n== CALI LINE: chuan bi, bat dau sau 5 giay... =="));
  for (int s = 5; s >= 1; s--) {           // dem nguoc, moi giay 1 tick ngan
    Serial.printf("  %d...\n", s);
    buzzerTone(1000, 60);
    delay(940);
  }
  buzzerTone(1800, 400);                    // TONE BAT DAU (cao, dai)
  hubLog(">> QUET thanh cam bien qua VACH va NEN NGAY BAY GIO (5s)!");

  for (int i = 0; i < 8; i++) { lineMin[i] = 4095; lineMax[i] = 0; }
  unsigned long end = millis() + 5000;
  while (millis() < end) {
    readLine();
    for (int i = 0; i < 8; i++) {
      if (lineRaw[i] < lineMin[i]) lineMin[i] = lineRaw[i];
      if (lineRaw[i] > lineMax[i]) lineMax[i] = lineRaw[i];
    }
    delay(4);
  }
  for (int i = 0; i < 8; i++) lineThresh[i] = (lineMin[i] + lineMax[i]) / 2;
  lineCalibrated = true;

  buzzerTone(2600, 150); delay(80); buzzerTone(2600, 250);  // TONE KET THUC (2 beep)
  String rep = "[calib] XONG. thresh:";
  for (int i = 0; i < 8; i++) rep += " C" + String(i + 1) + "=" + String(lineThresh[i]);
  hubLog(rep);
  saveCalibration();   // luu vao NVS de tu nap lan sau
}

// ===================== NVS: luu/nap calibration =====================
void saveCalibration() {
  prefs.begin("line", false);
  prefs.putBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.putBool("done", true);
  prefs.end();
  Serial.println(F(">> Da luu calibration vao NVS (tu nap lan sau)"));
}
bool loadCalibration() {
  prefs.begin("line", true);
  bool done = prefs.getBool("done", false);
  if (done) prefs.getBytes("thresh", lineThresh, sizeof(lineThresh));
  prefs.end();
  if (done) {
    lineCalibrated = true;
    Serial.print(F(">> Da nap calibration tu NVS: "));
    for (int i = 0; i < 8; i++) Serial.printf("%d ", lineThresh[i]);
    Serial.println();
  }
  return done;
}

float pulsesToMM(long pulses) {
  float circ = PI * WHEEL_DIAMETER_MM;       // chu vi
  return (float)pulses / ENCODER_PPR * circ; // quang duong
}

void printMenu() {
  Serial.println(F("\n===== MENU TEST / HIEU CHUAN ====="));
  Serial.println(F("--- MOTOR (2 banh) ---"));
  Serial.println(F("  f = ca 2 banh tien     b = ca 2 banh lui"));
  Serial.println(F("  l = quay trai          r = quay phai"));
  Serial.println(F("  1 = chi banh TRAI tien 2 = chi banh PHAI tien"));
  Serial.println(F("  x = dung               + / - = tang/giam toc"));
  Serial.println(F("  v<so> = dat toc do (vd v200)"));
  Serial.println(F("--- ENCODER ---"));
  Serial.println(F("  e = reset bo dem       p = in xung + quang duong"));
  Serial.println(F("--- SERVO ---"));
  Serial.println(F("  o = THA hang           h = GIU hang"));
  Serial.println(F("  s<goc> = dat goc servo (vd s45)"));
  Serial.println(F("  H<goc> = dat goc GIU   D<goc> = dat goc THA"));
  Serial.println(F("--- DO LINE (MUX) ---"));
  Serial.println(F("  m = in 8 mat lien tuc  M = dung in"));
  Serial.println(F("  n = in 8 mat 1 lan"));
  Serial.println(F("  c = CALI line (5s dem nguoc + tone, roi quet cam bien)"));
  Serial.println(F("--- BAM LINE (PID) + ODOMETRY ---"));
  Serial.println(F("  g = bat dau bam line   x = dung"));
  Serial.println(F("  B<so> = toc do co ban  (vd B130)"));
  Serial.println(F("  kp<so> kd<so> ki<so> = chinh he so PID (vd kp25)"));
  Serial.println(F("  q = in vi tri (x,y,theta)   e = reset odometry"));
  Serial.println(F("--- RE CHUAN (PID) ---"));
  Serial.println(F("  T<goc> = re tai cho (vd T90, T-90)"));
  Serial.println(F("  Tp<so> Td<so> = chinh he so PID re"));
  Serial.println(F("--- CAU HINH MANG (WiFi + IP laptop) ---"));
  Serial.println(F("  Wn<ten> = ten WiFi     Wp<mk> = mat khau"));
  Serial.println(F("  Wh<ip>  = IP laptop    Ws = luu + ket noi lai"));
  Serial.println(F("  W       = xem cau hinh hien tai"));
  Serial.println(F("--- KHAC ---"));
  Serial.println(F("  z = buzzer beep        ? = menu nay"));
  Serial.println(F("==================================\n"));
}

