huygithcm/code_tung/esp32_car/src/main.cpp
void handleRoot()   { server.send_P(200, "text/html", PAGE_HTML); }
void handleStart()  { lineFollow = true; lastError = 0; errIntegral = 0;
                      Serial.println("[web] START bam line");
                      server.send(200, "text/plain", "started"); }
void handleStop()   { lineFollow = false; stopMotors();
                      Serial.println("[web] STOP");
                      server.send(200, "text/plain", "stopped"); }
void handleStatus() {
  char buf[160];
  snprintf(buf, sizeof(buf),
    "{\"run\":%d,\"err\":%.2f,\"lost\":%d,\"x\":%.0f,\"y\":%.0f,\"th\":%.0f}",
    lineFollow ? 1 : 0, lineError, lineLost ? 1 : 0,
    poseX, poseY, poseTheta * 180.0f / PI);
  server.send(200, "application/json", buf);
}

// ===================== DIEU PHOI: route tu hub =====================
// Gui trang thai xe ve hub (khop {status,node,pos,cargo} ma server.js cho).
// Frame odometry TRUNG frame map (HOME=(0,0), nhin +x=0deg) nen gui thang pose.
void sendTelemetry() {
  if (!hubOK) return;
  const char* st = running ? (cargo ? "moving" : "arrived") : "idle";
  char node[16];
  if (routeTarget.length()) snprintf(node, sizeof(node), "\"%s\"", routeTarget.c_str());
  else strcpy(node, "null");
  char buf[176];
  snprintf(buf, sizeof(buf),
    "{\"status\":\"%s\",\"node\":%s,\"pos\":{\"x\":%.0f,\"y\":%.0f,\"th\":%.0f},\"cargo\":%s}",
    st, node, poseX, poseY, poseTheta * 180.0f / PI, cargo ? "true" : "false");
  wsClient.sendTXT(buf);
}

// In log ra Serial VA day len hub duoi dang {type:"clog",text:...} de web hien thi.
void hubLog(const String& s) {
  Serial.println(s);
  if (!hubOK) return;
  JsonDocument d;
  d["type"] = "clog";
  d["text"] = s;
  String out;
  serializeJson(d, out);
  wsClient.sendTXT(out);
}

// Lai tay F/B/L/R (huy route dang chay). 'S'/khac = dung.
void doManual(const String& dir) {
  running = false; lineFollow = false; routeTarget = "";
  char d = dir.length() ? dir.charAt(0) : 'S';
  int s = motorSpeed;
  if      (d == 'F') { setMotorA(+1, s); setMotorB(+1, s); }
  else if (d == 'B') { setMotorA(-1, s); setMotorB(-1, s); }
  else if (d == 'L') { setMotorA(-1, s); setMotorB(+1, s); }
  else if (d == 'R') { setMotorA(+1, s); setMotorB(-1, s); }
  else stopMotors();
}

// Tha hang: dung -> ha servo -> beep -> ve goc giu.
void doDrop() {
  stopMotors();
  servo.write(SERVO_DROP);
  cargo = false;
  beep(120);
  delay(400);                 // cho co cau tha xong
  servo.write(SERVO_HOLD);
  hubLog("[drop] Da tha hang");
  sendTelemetry();
}

// Ket thuc don (da ve HOME): dung, san sang don ke tiep.
void finishRoute() {
  stopMotors(); lineFollow = false;
  running = false; stepPhase = 0;
  routeTarget = ""; cargo = true;
  hubLog("[route] xong -> ve HOME, san sang");
  sendTelemetry();
}

// Nap chuoi buoc tu hub va bat dau. Re-anchor odometry tai HOME.
void startRoute(JsonArrayConst steps, const char* target) {
  routeN = 0;
  for (JsonVariantConst v : steps) if (routeN < 48) route[routeN++] = String(v.as<const char*>());
  routeIdx = 0; stepPhase = 0; leftStart = false;
  routeTarget = target ? target : "";
  cargo = true;
  resetOdometry();            // xe dang o HOME -> xoa troi tich luy
  running = true;
  hubLog("[route] bat dau -> " + routeTarget + " (" + String(routeN) + " buoc)");
}

// Chay 1 nhip cua route (goi trong loop khi running).
// Moi buoc F/L/R/B = RE truoc (0/+90/-90/180) roi TIEN 1 canh toi giao diem/het line.
void routeStep() {
  if (routeIdx >= routeN) { finishRoute(); return; }
  String s = route[routeIdx];

  if (s == "DROP") { doDrop(); routeIdx++; return; }
  if (s == "HOME") { routeIdx++; return; }   // buoc cuoi -> finishRoute o nhip sau

  if (stepPhase == 0) {                       // --- Pha 0: re dau doan ---
    float deg = 0;
    if      (s == "L") deg = 90;
    else if (s == "R") deg = -90;
    else if (s == "B") deg = 180;
    if (deg != 0) turnRelative(deg);          // rE tai cho (PID, blocking)
    segStartX = poseX; segStartY = poseY; leftStart = false;
    lastError = 0; errIntegral = 0;
    stepPhase = 1;
    return;
  }

  // --- Pha 1: tien bam line den giao diem ke (hoac het line = tam o) ---
  lineFollowStep();
  float trav = hypotf(poseX - segStartX, poseY - segStartY);
  if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi nga tu cu
  bool done = false;
  if (trav > MIN_EDGE) {
    if (leftStart && (lineCount >= INTERSECT_N || lineLost)) done = true;  // toi nga tu / het line
    if (trav > MAX_EDGE) done = true;                                       // an toan
  }
  if (done) { stopMotors(); stepPhase = 0; routeIdx++; }
}

// ===================== Hieu chuan quang duong =====================
// Chay thang bam line tu giao diem hien tai -> giao diem ke (biet knownMM, mac dinh 475).
// Do quang duong odometry (trung binh 2 banh) roi goi y WHEEL_DIAMETER da hieu chuan.
void calibDistance(float knownMM) {
  running = false; lineFollow = false;
  resetOdometry();
  leftStart = false;
  hubLog("[caldist] Chay thang toi giao diem ke (biet " + String(knownMM, 0) + "mm)...");

  unsigned long t0 = millis();
  auto travel = []() { return (fabs(pulsesToMM(encL)) + fabs(pulsesToMM(encR))) * 0.5f; };  // mm trung binh 2 banh
  while (millis() - t0 < 8000) {                 // timeout 8s
    updateOdometry();
    lineFollowStep();                            // bam line 1 nhip
    float trav = travel();
    if (!leftStart && lineCount <= 2 && !lineLost) leftStart = true;   // da roi giao diem xuat phat
    if (trav > MIN_EDGE) {
      if (leftStart && (lineCount >= INTERSECT_N || lineLost)) break;  // toi giao diem ke
      if (trav > MAX_EDGE) break;                                      // an toan
    }
    delay(5);
  }
  stopMotors();

  float measured = travel();
  float suggest  = (measured > 1) ? WHEEL_DIAMETER_MM * knownMM / measured : WHEEL_DIAMETER_MM;
  char buf[176];
  snprintf(buf, sizeof(buf),
    "[caldist] biet=%.0fmm do=%.1fmm (encL=%ld encR=%ld) | WHEEL_DIAMETER hien=%.2f -> goi y=%.2fmm",
    knownMM, measured, encL, encR, WHEEL_DIAMETER_MM, suggest);
  hubLog(buf);
}

// Su kien WebSocket toi hub.
void onWsEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED:
      hubOK = true;
      wsClient.sendTXT("{\"role\":\"car\"}");
      Serial.println("[ws] Da ket noi hub, khai bao role=car");
      break;
    case WStype_DISCONNECTED:
      hubOK = false;
      Serial.println("[ws] Mat ket noi hub");
      break;
    case WStype_TEXT: {
      JsonDocument doc;
      if (deserializeJson(doc, payload, len)) return;   // loi parse -> bo
      const char* cmd = doc["cmd"];
      if (!cmd) return;                                 // hello/khac -> bo qua
      if      (!strcmp(cmd, "route"))  startRoute(doc["steps"].as<JsonArrayConst>(), doc["target"] | "");
      else if (!strcmp(cmd, "stop"))   { running = false; lineFollow = false; stopMotors(); routeTarget = ""; hubLog("[ws] STOP"); }
      else if (!strcmp(cmd, "manual")) doManual(String((const char*)(doc["dir"] | "S")));
      else if (!strcmp(cmd, "drop"))   doDrop();
      else if (!strcmp(cmd, "calib"))  { hubLog("[calib] Bat dau hieu chuan line..."); calibrateLine(); }
      else if (!strcmp(cmd, "tune")) {                  // chinh tham so runtime tu web
        if (!doc["base"].isNull())     baseSpeed     = constrain((int)doc["base"], 0, 255);
        if (!doc["min"].isNull())      MOTOR_MIN_PWM = constrain((int)doc["min"], 0, 255);
        if (!doc["kp"].isNull())       Kp = (float)doc["kp"];
        if (!doc["kd"].isNull())       Kd = (float)doc["kd"];
        if (!doc["turnmin"].isNull())  TURN_MIN = constrain((int)doc["turnmin"], 0, 255);
        if (!doc["turnmax"].isNull())  TURN_MAX = constrain((int)doc["turnmax"], 0, 255);
        if (!doc["speed"].isNull())    motorSpeed = constrain((int)doc["speed"], 0, 255);
        if (!doc["kpt"].isNull())      KpT = (float)doc["kpt"];
        if (!doc["kdt"].isNull())      KdT = (float)doc["kdt"];
        if (!doc["turntol"].isNull())  TURN_TOL_DEG = (float)doc["turntol"];
        if (!doc["wheeld"].isNull())   WHEEL_DIAMETER_MM = (float)doc["wheeld"];
        if (!doc["ppr"].isNull())      ENCODER_PPR = (int)doc["ppr"];
        if (!doc["wbase"].isNull())    WHEEL_BASE_MM = (float)doc["wbase"];
        hubLog("[tune] base=" + String(baseSpeed) + " min=" + String(MOTOR_MIN_PWM) +
               " kp=" + String(Kp, 1) + " kd=" + String(Kd, 1) +
               " turnmin=" + String(TURN_MIN) + " turnmax=" + String(TURN_MAX) +
               " kpt=" + String(KpT, 1) + " kdt=" + String(KdT, 1) +
               " tol=" + String(TURN_TOL_DEG, 1) + " speed=" + String(motorSpeed) +
               " wheeld=" + String(WHEEL_DIAMETER_MM, 2) + " ppr=" + String(ENCODER_PPR) +
               " wbase=" + String(WHEEL_BASE_MM, 1));
      }
      else if (!strcmp(cmd, "turn")) {                  // test 1 cu re (deg): +trai / -phai
        float deg = doc["deg"] | 90.0;
        hubLog("[turn] test re " + String(deg, 0) + " do...");
        turnRelative(deg);
      }
      else if (!strcmp(cmd, "enc")) {                   // doc encoder (hieu chuan chieu dem)
        if (!doc["reset"].isNull()) resetOdometry();
        hubLog("[enc] L=" + String(encL) + " R=" + String(encR) +
               " x=" + String(poseX, 0) + " y=" + String(poseY, 0) +
               " th=" + String(poseTheta * 180.0f / PI, 1));
      }
      else if (!strcmp(cmd, "caldist")) {               // hieu chuan quang duong (1 canh line)
        calibDistance(doc["known"] | 475.0);
      }
      break;
    }
    default: break;
  }
}

