huygithcm/code_tung/esp32_car/src/main.cpp
// ===================== NVS: luu/nap cau hinh mang =====================
void loadNetConfig() {
  prefs.begin("net", true);
  cfgSsid = prefs.getString("ssid", WIFI_SSID);
  cfgPass = prefs.getString("pass", WIFI_PASS);
  cfgHub  = prefs.getString("hub",  HUB_HOST);
  prefs.end();
  Serial.printf(">> Cau hinh mang: SSID='%s'  HUB=%s\n", cfgSsid.c_str(), cfgHub.c_str());
}
void saveNetConfig() {
  prefs.begin("net", false);
  prefs.putString("ssid", cfgSsid);
  prefs.putString("pass", cfgPass);
  prefs.putString("hub",  cfgHub);
  prefs.end();
  Serial.println(F(">> Da luu cau hinh mang vao NVS (giu sau khi tat nguon)"));
}

void startOTA() {
  if (!wifiOK) return;
  ArduinoOTA.setHostname("esp32-car");
  // ArduinoOTA.setPassword("1234");   // mo neu muon dat mat khau OTA
  ArduinoOTA.onStart([]() { stopMotors(); Serial.println(F("[OTA] Bat dau nap firmware...")); });
  ArduinoOTA.onEnd([]()   { Serial.println(F("\n[OTA] Xong. Khoi dong lai.")); });
  ArduinoOTA.onProgress([](unsigned p, unsigned t) { Serial.printf("[OTA] %u%%\r", p * 100 / t); });
  ArduinoOTA.onError([](ota_error_t e) { Serial.printf("[OTA] Loi %u\n", e); });
  ArduinoOTA.begin();
  Serial.printf(">> OTA san sang: pio run -e ota -t upload  (IP %s)\n", WiFi.localIP().toString().c_str());
}

void startHub() {
  if (!wifiOK) return;
  wsClient.begin(cfgHub.c_str(), HUB_PORT, "/");
  wsClient.onEvent(onWsEvent);
  wsClient.setReconnectInterval(3000);
  Serial.printf(">> Ket noi hub  ws://%s:%d\n", cfgHub.c_str(), HUB_PORT);
}

void setupWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(cfgSsid.c_str(), cfgPass.c_str());
  Serial.printf("Ket noi WiFi '%s' ...\n", cfgSsid.c_str());
  unsigned long t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 10000) { delay(250); Serial.print('.'); }
  Serial.println();
  if (WiFi.status() == WL_CONNECTED) {
    wifiOK = true;
    Serial.print(F(">> WiFi OK. Mo trinh duyet: http://"));
    Serial.println(WiFi.localIP());
    server.on("/", handleRoot);
    server.on("/start", handleStart);
    server.on("/stop", handleStop);
    server.on("/status", handleStatus);
    server.begin();
    beep(80);
  } else {
    Serial.println(F(">> WiFi FAIL - chay khong web (van dieu khien qua Serial)"));
  }
}

// ===================== Setup =====================
void setup() {
  Serial.begin(115200);
  delay(300);

  // Motor pins
  pinMode(MA_IN1, OUTPUT); pinMode(MA_IN2, OUTPUT);
  pinMode(MB_IN3, OUTPUT); pinMode(MB_IN4, OUTPUT);
  ledcSetup(MA_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MA_EN, MA_CH);
  ledcSetup(MB_CH, PWM_FREQ, PWM_RES); ledcAttachPin(MB_EN, MB_CH);
  stopMotors();

  // Buzzer
  pinMode(BUZZER, OUTPUT); digitalWrite(BUZZER, LOW);

  // MUX 74HC4067
  pinMode(MUX_S0, OUTPUT); pinMode(MUX_S1, OUTPUT);
  pinMode(MUX_S2, OUTPUT); pinMode(MUX_S3, OUTPUT);
  analogReadResolution(12);   // 0..4095

  // Encoder pins (input-only 13/14/15/17 deu co pull-up noi)
  pinMode(ENC_L_A, INPUT_PULLUP); pinMode(ENC_L_B, INPUT_PULLUP);
  pinMode(ENC_R_A, INPUT_PULLUP); pinMode(ENC_R_B, INPUT_PULLUP);
  attachInterrupt(digitalPinToInterrupt(ENC_L_A), isrEncL, RISING);
  attachInterrupt(digitalPinToInterrupt(ENC_R_A), isrEncR, RISING);

  // Servo
  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 500, 2400);
  servo.write(SERVO_HOLD);

  loadCalibration();   // nap calibration tu NVS (neu co)
  loadNetConfig();     // nap SSID / mat khau / IP hub tu NVS (neu co)
  setupWiFi();         // ket noi WiFi + bat web server
  startHub();          // WebSocket client toi hub (chi khi da co WiFi)
  startOTA();          // bat nap firmware qua WiFi (OTA)

  Serial.println(F("\n>> Firmware san sang (dieu phoi route tu hub)"));
  printMenu();
}

// ===================== Loop =====================
unsigned long lastPrint = 0;
void loop() {
  // Doc lenh tu Serial
  if (Serial.available()) {
    String line = Serial.readStringUntil('\n');
    handleCommand(line);
  }

  // Web server + WebSocket client toi hub + OTA
  if (wifiOK) { server.handleClient(); wsClient.loop(); ArduinoOTA.handle(); }

  // Odometry: cap nhat lien tuc
  updateOdometry();

  // Dieu phoi: chay route tu hub; neu khong, cho phep bam line thu cong (menu 'g')
  static unsigned long lastPid = 0;
  if (running) {
    if (stepPhase == 0) routeStep();                                    // buoc re (blocking) chay ngay
    else if (millis() - lastPid >= 10) { lastPid = millis(); routeStep(); }  // tien PID ~10ms
  } else if (lineFollow && millis() - lastPid >= 10) {
    lastPid = millis();
    lineFollowStep();
  }

  // Gui telemetry ve hub moi 200ms
  static unsigned long lastTel = 0;
  if (hubOK && millis() - lastTel >= 200) { lastTel = millis(); sendTelemetry(); }

  // Stream 8 mat do line moi 200ms
  static unsigned long lastLine = 0;
  if (streamLine && millis() - lastLine > 200) {
    lastLine = millis();
    printLine();
  }

  // In dinh ky moi 500ms (chi o ban DEBUG)
#if DEBUG_MODE
  if (millis() - lastPrint > 500) {
    lastPrint = millis();
    if (lineFollow) {
      Serial.printf("[line] err=%.2f %s | x=%.0f y=%.0f th=%.0fdeg\n",
                    lineError, lineLost ? "(MAT LINE)" : "",
                    poseX, poseY, poseTheta * 180.0f / PI);
    } else {
      static long lastL = 0, lastR = 0;
      if (encL != lastL || encR != lastR) {
        Serial.printf("[enc] L=%ld (%.1fmm)  R=%ld (%.1fmm)\n",
                      encL, pulsesToMM(encL), encR, pulsesToMM(encR));
        lastL = encL; lastR = encR;
      }
    }
  }
#endif
}

